Revit 2024 API
BuiltInFailures.RebarFailures.TooLargeNumberOfBars Property
 Rebar Set must contain at most 1002 bar locations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TooLargeNumberOfBars { get; }
Visual Basic
Public Shared ReadOnly Property TooLargeNumberOfBars As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TooLargeNumberOfBars {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace